results/springboot/m8i-flex.xlarge/wrk1.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: m8i-flex.xlarge
Spring Boot Host: springboot-server-m8i-flex-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-m8i-flex-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   832.23us  357.90us  17.09ms   90.25%
    Req/Sec    29.93k     3.07k   35.15k    61.33%
  Latency Distribution
     50%  736.00us
     75%    0.86ms
     90%    1.18ms
     99%    2.08ms
  3573354 requests in 1.00m, 477.74MB read
Requests/sec:  59548.25
Transfer/sec:      7.96MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-m8i-flex-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.32ms  574.82us  31.56ms   89.43%
    Req/Sec    37.72k     2.86k   43.80k    67.25%
  Latency Distribution
     50%    1.19ms
     75%    1.40ms
     90%    1.75ms
     99%    3.27ms
  4503923 requests in 1.00m, 602.15MB read
Requests/sec:  75002.79
Transfer/sec:     10.03MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-m8i-flex-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.40ms  689.48us  37.42ms   84.93%
    Req/Sec    41.50k     2.03k   45.77k    69.06%
  Latency Distribution
     50%    2.30ms
     75%    2.56ms
     90%    3.03ms
     99%    4.71ms
  2469206 requests in 30.05s, 330.12MB read
Requests/sec:  82166.17
Transfer/sec:     10.99MB

===== Spring Boot Benchmark Complete =====